#language: ru

Функционал: Ozon


  Сценарий: Первая проверка функционала

    * закрываем окно с cookies
    * выполняем поиск продукта "iphone"
    * ограничиваем цену до "100000"
    * отмечаем чекбокс - "Высокий рейтинг"
    * отмечаем чекбокс - "3 ГБ"
    * добавляем в корзину первые "8" "нечетных" товаров
    * переходим в корзину
    * проверяем товары в корзине
    * проверяем текст "Ваша корзина - "8 товаров""
    * удаляем все товары из корзины
    * проверяем, что корзина пустая
    * прикладываем файл с информацией о всех добавленных товарах

  Сценарий: Вторая проверка функционала

    * выполняем поиск продукта "беспроводные наушники"
    * закрываем окно с cookies
    * ограничиваем цену до "10000"
    * отмечаем чекбокс - "Высокий рейтинг"
    * смотрим на все бренды
    * выбираем бренд - "Beats"
    * выбираем бренд - "Samsung"
    * добавляем в корзину "все" "четные" товары
    * переходим в корзину
    * проверяем товары в корзине
    * проверяем текст "Ваша корзина - "1 товар""
    * удаляем все товары из корзины
    * проверяем, что корзина пустая
    * прикладываем файл с информацией о всех добавленных товарах



